/*
*************************************************************************
*硬件平台: STC89C52RC
*开发平台：keil 4.7
*版权    ：沁和智能科技
*开始时间：2019.7.11
*结束时间：2019.7.11
*作者：    张文超
*备注：    串口库函数 --- 未经允许，用于商业用途，必究责任
*************************************************************************
*/

#include "serial.h"

void Init_UART(void) 
{
    TH1 = 0xFD;	 //11.0592mhz  9600
    TL1 = TH1;
    TMOD |= 0x20;	  
    SCON = 0x50;	 
    ES = 1;			  
    TR1 = 1;		 
    TI = 1;    
		PS = 0;
	  EA = 1;	  	 
}